import random
from datetime import datetime

FIXED_CATEGORIES = {
    "texture": [
        "サテン生地", "レザー生地", "木目", "石", "金属",
        "シルク生地", "ダイヤモンド", "オパール", "パール",
        "ガラス", "ネオンライト", "木漏れ日", "デニム生地", "羽毛"
    ],

    "pose": [
        "見上げる", "見下ろす", "走る", "転ぶ", "しゃがむ",
        "ジャンプ", "上に手が届かない…", "椅子に座る", "地面に座る",
        "背中", "横顔", "振り向く", "伸び", "ウォーミングアップ",
        "髪を耳にかける", "ギャルピース", "髪を縛る", "足を見せる",
        "裾を持つ", "銃を構える", "ペンを持つ", "メガネｸｲｯ",
        "タイピング", "スマホを使う", "スマホでもしもし？",
        "古の電話でもしもし？", "傘を差す", "剣を構える",
        "ハグ", "目隠し", "あーん", "腕を絡める",
        "手をつなぐ", "恋人繋ぎ", "指切りげんまん"
    ],

    "background": [
        "街角", "港", "夜景", "路地裏", "図書館",
        "学校", "駅", "噴水", "公園", "リビング",
        "電車の車内", "カフェの窓際", "映画館",
        "廃墟", "温室", "屋上", "海辺", "森の中"
    ],

    "item": [
        "バラ", "棒キャンディ", "傘", "本",
        "スマホ", "イヤホン", "花束", "マグカップ",
        "リボン", "扇子", "ぬいぐるみ", "風船",
        "カメラ", "ペン"
    ],

    "mood": [
        "逆光", "虹", "朝焼け", "夕暮れ", "オーロラ"
    ],

    "situation": [
        "雨宿り", "相合傘", "徹夜中",
        "散歩", "1日だけの休み",
        "料理中", "読書中"
    ],

    "fashion": [
        "パーカー", "ロングスカート", "ホットパンツ",
        "キャミソール", "ジーンズ", "セーラー服",
        "浴衣", "着物", "ウェディングドレス",
        "タキシード", "ダンスドレス", "レオタード",
        "バニー服", "ストッキング", "ニット帽",
        "ブーツ", "ハイヒール", "マフラー",
        "手袋", "ピアス"
    ],

    "style": [
        "デフォルメ",
        "ヴィネットイラスト",
        "フカン",
        "アオリ"
    ]
}

SEASON_WORDS = {
    "winter": ["餅", "墨汁", "雪", "オーロラ"],
    "spring": ["卒業", "桜", "チューリップ"],
    "summer": ["アジサイ", "傘", "波"],
    "autumn": ["紅葉"]
}

MONTH_TO_SEASON = {
    12: "winter",
    1: "winter",
    2: "winter",

    3: "spring",
    4: "spring",
    5: "spring",

    6: "summer",
    7: "summer",
    8: "summer",

    9: "autumn",
    10: "autumn",
    11: "autumn"
}


def get_random_odai() -> str:

    current_month = datetime.now().month

    season = MONTH_TO_SEASON[current_month]

    all_odai = []

    for values in FIXED_CATEGORIES.values():
        all_odai.extend(values)

    all_odai.extend(SEASON_WORDS[season])

    return random.choice(all_odai)